while True:
    num = int(input('Enter: '))

    if num//100 == 1:
        n_1 = 'сто'
    elif num//100 == 2:
        n_1 = 'двести'
    elif num//100 == 3:
        n_1 = 'триста'
    elif num//100 == 4:
        n_1 = 'четыресто'
    elif num//100 == 5:
        n_1 = 'пятьсот'
    elif num//100 == 6:
        n_1 = 'шестьсот'
    elif num//100 == 7:
        n_1 = 'семьсот'
    elif num//100 == 8:
        n_1 = 'восемьсот'
    elif num//100 == 9:
        n_1 = 'девятьсот'
    else:
        print ('FF')
    '''
    if num%100 == 11:
        n_2 = 'одинадцать'
    elif num%100 == 12:
        n_2 = 'двенадцать'
    elif num%100 == 13:
        n_2 = 'тринадцать'
    elif num%100 == 14:
        n_2 = 'четырнадцать'
    elif num%100 == 15:
        n_2 = 'пятнадцать'
    elif num%100 == 16:
        n_2 = 'шестнадцать'
    elif num%100 == 17:
        n_2 = 'семнадцать'
    elif num%100 == 18:
        n_2 = 'восемнадцать'
    elif num%100 == 19:
        n_2 = 'девятнадцать'
    else:
        n_2 = ' '
    '''

    if num//10%10 == 1:
            if num%100 == 11:
                n_2 = 'одиннадцать'
            elif num%100 == 12:
                n_2 = 'двенадцать'
            elif num%100 == 13:
                n_2 = 'тринадцать'
            elif num%100 == 14:
                n_2 = 'четырнадцать'
            elif num%100 == 15:
                n_2 = 'пятнадцать'
            elif num%100 == 16:
                n_2 = 'шестнадцать'
            elif num%100 == 17:
                n_2 = 'семнадцать'
            elif num%100 == 18:
                n_2 = 'восемнадцать'
            elif num%100 == 19:
                n_2 = 'девятнадцать'
            else:
                n_2 = ' ' 
    elif num//10%10 == 2:
        n_3 = 'двадцать'
        n_2 = ' '
    elif num//10%10 == 3:
        n_3 = 'тридцать'
        n_2 = ' '
    elif num//10%10 == 4:
        n_3 = 'сорок'
        n_2 = ' '
    elif num//10%10 == 5:
        n_3 = 'пятьдесят'
        n_2 = ' '
    elif num//10%10 == 6:
        n_3 = 'шестьдесят'
        n_2 = ' '
    elif num//10%10 == 7:
        n_3 = 'семьдесят'
        n_2 = ' '
    elif num//10%10 == 8:
        n_3 = 'восемьдесят'
        n_2 = ' '
    elif num//10%10 == 9:
        n_3 = 'девяносто'
        n_2 = ' '
    else:
        n_3 = ' '
        n_2 = ' '

    if num%10 == 1:
        n_4 = 'один'
    elif num%10 == 2:
        n_4 = 'два'
    elif num%10 == 3:
        n_4 = 'три'
    elif num%10 == 4:
        n_4 = 'четыре'
    elif num%10 == 5:
        n_4 = 'пять'
    elif num%10 == 6:
        n_4 = 'шесть'
    elif num%10 == 7:
        n_4 = 'семь'
    elif num%10 == 8:
        n_4 = 'восемь'
    elif num%10 == 9:
        n_4 = 'девять'

    if n_2 != ' ':
        print (n_1, n_2)
    elif n_2 == ' ':
        print (n_1,n_3,n_4)

